local L = LibStub("AceLocale-3.0"):NewLocale("ClassicCastbars", "ruRU")
if not L then return end

L["AUTO_POS_BAR"] = "Автоматическое позиционирование полосы применения"
L["AUTO_POS_BAR_TOOLTIP"] = [=[Когда он включен, он автоматически позиционирует полосу применения, основываясь на таких вещах, как, для примера, сколько баффов показано во фрейме юнита и так далее.

Не работает со сторонними фреймами.]=]
L["CASTBAR_SIZING"] = "Размер полосы применения"
L["GENERAL"] = "Общие Настройки"
L["HEIGHT"] = "Высота"
L["HEIGHT_TOOLTIP"] = "Устанавливает высоту полосы применения. По умолчанию это 14."
L["ICON_SIZE"] = "Размер иконки"
L["ICON_SIZE_TOOLTIP"] = "Установите размер для иконки заклинания полосы применения."
L["NAMEPLATE"] = "Табличка с именем"
L["PUSHBACK"] = "Обнаружить Сопротивление (|cFFFF0000Экспериментальный|r)"
L["PUSHBACK_TOOLTIP"] = "Включает обнаружение отталкивающих заклинаний и уменьшений (например Проклятие косноязычия). Эта работа еще не завершена."
L["RESET_ALL"] = "Сбросить все настройки"
L["SHOW_RANK"] = "Показать уровень заклинания"
L["SHOW_RANK_TOOLTIP"] = [=[Показать уровень заклинаний для текущего заклинания. Например, Ледяная стрела (Уровень 1).

Работает только тогда, когда заклинания кэшируются, поэтому, когда вы впервые видите новое заклинание, оно не будет отображаться до второго чтения.]=]
L["SHOW_TIMER"] = "Показать Время Применения"
L["SHOW_TIMER_TOOLTIP"] = "Показать время обратного отсчета для текущего применения."
L["SIMPLE_STYLE"] = "Простой стиль полосы применения"
L["SIMPLE_STYLE_TOOLTIP"] = [=[Скрывает границу полосы применения и перемещает иконку заклинания ближе к полосе применения. Иконка также будет использовать ту же высоту, что и полоса.

При этой настройке рекомендуется использовать более высокую полосу применения.]=]
L["TARGET"] = "Цель"
L["TEST"] = "Тестирование переключателя"
L["TEST_MODE"] = "Тестовый режим и позиционирование"
L["TEST_MODE_DRAG"] = "Тестовый Режим - Перетаскивать"
L["TEST_PLATE_TOOLTIP"] = [=[Показать табличку с именем для тестирования полосы применения. Вы можете передвинуть полосу применения.
|cFFFF0000Вам нужно взять в цель кого либо, чтобы увидеть полосу применения.|r]=]
L["TEST_TARGET_TOOLTIP"] = [=[Показать рамку цели для тестирования полосы применения. Вы можете переместить полосу применения но это отключит автоматическое позиционирование.
|cFFFF0000Вам нужно взять в цель кого либо, чтобы увидеть полосу применения.|r]=]
L["TOGGLE_CASTBAR"] = "Включить полосу применения"
L["TOGGLE_CASTBAR_TOOLTIP"] = "Включает или отключает полосу применения для данного конкретного фрейма."
L["WIDTH"] = "Ширина"
L["WIDTH_TOOLTIP"] = "Устанавливает ширину полосы применения. По умолчанию 150."
